{"data":{"reviews":{"edges":[{"node":{"excerpt":"I'll be honest, I really wanted to like this book. I'll start off by saying I was a huge fan of the Eragon series when I first read it in elementary school, and I've reread it as recently as last year with much of the same enjoyment. For those of you…","id":"b51402eb-b67a-527d-b9f0-61180c9e009f","frontmatter":{"title":"To Sleep in a Sea of Stars","date":"21-10-2020","path":"/reviews/to-sleep-in-a-sea-of-stars"}}},{"node":{"excerpt":"Note: This review covers only the three book trilogy by Liu Cixin, and not the fourth book, The Redemption of Time by Baoshu. Liu Cixin gave his blessing for the publication of The Redemption of Time but frankly, at this time, I haven't even read it…","id":"8ac560d3-5bda-5cd5-aa33-380e59967927","frontmatter":{"title":"The Three-Body Trilogy","date":"24-08-2020","path":"/reviews/the-three-body-problem"}}},{"node":{"excerpt":"Dune took me a really long time to get through. The sheer size of the world was a little overwhelming at first. I ended up reading it in two parts, taking a break to read a few other books in between. There's fantastic world-building and it's well…","id":"e9190b02-68a4-5b19-88f3-dd295513a8cf","frontmatter":{"title":"Dune","date":"22-07-2020","path":"/reviews/dune"}}},{"node":{"excerpt":"An interesting historical fiction novel that spans about four generations of a Korean family living in Japan in the 20th century. It’s not a book that holds a plot at all, it simply follows the lives of the family, but the prose and the scenes it…","id":"d5c849ac-4aa8-5d9c-9fa5-a06325611144","frontmatter":{"title":"Pachinko","date":"20-06-2020","path":"/reviews/pachinko"}}},{"node":{"excerpt":"I’ve been reading a lot this past winter break. A lot of non-fiction at first, but quite a bit of fiction in the last few days. The most notable fiction novel that stood out to me was Normal People. Though still a book with a number of faults, I…","id":"1c80c439-36a9-52fe-a402-2539cf33f1d7","frontmatter":{"title":"Normal People","date":"30-12-2019","path":"/reviews/normal-people"}}},{"node":{"excerpt":"This was a frustrating book to read. Not because it was poorly written, in fact, for quite the opposite reason. The book is, at its core, a book about society’s unconcious biases against women, but was far more in-depth and well-researched than…","id":"10648526-3ca7-51a3-9e2f-e7c7040821ec","frontmatter":{"title":"Invisible Women","date":"01-11-2019","path":"/reviews/invisible-women"}}},{"node":{"excerpt":"I heard a lot about this book before I picked it up. The reviews I had heard were always extreme; either someone absolutely loved it, or they thought the book was just chock-full of useless advice. As for myself, I didn’t hate it, but it didn’t blow…","id":"b56f3e61-f983-50b7-a88a-f5f403e92770","frontmatter":{"title":"The Subtle Art of Not Giving a F*ck","date":"13-10-2019","path":"/reviews/the-subtle-art-of-not-giving-a-f*ck"}}}]},"poems":{"edges":[{"node":{"excerpt":"one drink to be polite five to cut a deal \"Drink to your health!\" reverberates around the room as alcohol sloshes in and out of glasses oil down their throats empty promises but with cups fuller than  their minds walked in a businessman walked out a…","id":"c350a0ac-909f-581d-9b84-71898a7a80ff","frontmatter":{"title":"drink","date":null,"path":"/poems/drink"}}},{"node":{"excerpt":"","id":"1c83b220-a93e-5002-b3c5-b493c7c425d5","frontmatter":{"title":"up in smoke","date":null,"path":"/poems/up-in-smoke"}}}]},"essays":{"edges":[]}}}